<?php

/**
 * Сортировка пузырьком - не удалось дождаться результата сортировки
 * Сортировка вставками - не удалось дождаться результата сортировки
 * Сортировка расческой: 2.282576084137
 * Сортировка слиянием: 1.1379780769348
 * Сортировка пирамидальная: 2.4519491195679
 * Сортировка пирамидальная SPL: 0.33528208732605
 * Сортировка быстрая наша - ошибка "Allowed memory size of 134217728 bytes exhausted (tried to allocate 8388616 bytes)"
 * Сортировка быстрая чужая: 0.60991907119751
 * Сортировка из PHP: 0.1376781463623
 * Сортировка выбором - не удалось дождаться результата сортировки
 * Сортировка голубиная: 0.26416397094727
 *
 */
